#!/bin/bash

while : #Запускается основной цикл
do
cat << EOF
+-------------------------------------------------------------------------------+
|                               Модуль                                          |
|                        для тестирования сетей                                 |
+-------------------------------------------------------------------------------+
EOF

    echo "Добро пожаловать в модуль для тестирования сетей"
    echo "========================="
    echo "Пинг стандартными (56 байт) пакетами"
    echo "========================="
    ping -c 10 $1
    echo "Пинг большими (1000 байт) пакетами"
    echo "========================="
    ping -s 1000 -c 10 $1
    echo "Маршрут до узла"
    echo "========================="
    traceroute $1
    echo -e "\033[32mПроверка выполнена\033[0m"
    read
    exit
done